hr11D2/0/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

Uref                 constant 7;
Zref                 constant 3;
zDir                 (0 1 0);
flowDir              (1 0 0);
z0                   uniform 0.005;
zGround              uniform 0.0;
d                    uniform 0.0;
initABL              true;
kappa                0.40;          
Cmu                  0.09;  

// ************************************************************************* //
